Script started on 2020-09-10 10:29:06-04:00 [TERM="xterm-256color" TTY="/dev/pts/3" COLUMNS="120" LINES="30"]
fantona1@remote00:~/i220a/submit/lab2$ cd exercises/1-hello-args/
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ls
hello.c  Makefile  README
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ cat re[K[KREADME 
Print out a line saying hello to each command-line argument.
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ make
cc -g -Wall -std=c11    hello.c   -o hello
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ./hello Jo Mama
hello Jo
hello Mama
hello (null)
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start bart lisa
Temporary breakpoint 1 at 0x118b: file hello.c, line 13.
Starting program: /import/linux/home1/fantona1/projects/i220a/submit/lab2/exercises/1-hello-args/hello bart lisa

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe7d8) at hello.c:13
13	  if (argc == 1) {
(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) 1
Undefined command: "1".  Try "help".
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
15	    exit(1);
16	  }
17	  else {
(gdb) l14
Undefined command: "l14".  Try "help".
(gdb) l 14
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
15	    exit(1);
16	  }
17	  else {
18	    for (int i = 1; i <= argc; i++) {
(gdb) b say_hello 
Breakpoint 2 at 0x555555555161: file hello.c, line 7.
(gdb) arcs
Undefined command: "arcs".  Try "help".
(gdb) argc
Undefined command: "argc".  Try "help".
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe7d8
(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) [K(gdb) 
$3 = (const char **) 0x7fffffffe7d8
(gdb) 
$4 = (const char **) 0x7fffffffe7d8
(gdb) 
$5 = (const char **) 0x7fffffffe7d8
(gdb) 
$6 = (const char **) 0x7fffffffe7d8
(gdb) 
$7 = (const char **) 0x7fffffffe7d8
(gdb) 
$8 = (const char **) 0x7fffffffe7d8
(gdb) 
$9 = (const char **) 0x7fffffffe7d8
(gdb) 
$10 = (const char **) 0x7fffffffe7d8
(gdb) 
$11 = (const char **) 0x7fffffffe7d8
(gdb) 
$12 = (const char **) 0x7fffffffe7d8
(gdb) 
$13 = (const char **) 0x7fffffffe7d8
(gdb) 
$14 = (const char **) 0x7fffffffe7d8
(gdb) 
$15 = (const char **) 0x7fffffffe7d8
(gdb) 
$16 = (const char **) 0x7fffffffe7d8
(gdb) 
$17 = (const char **) 0x7fffffffe7d8
(gdb) 
$18 = (const char **) 0x7fffffffe7d8
(gdb) 
$19 = (const char **) 0x7fffffffe7d8
(gdb) 
$20 = (const char **) 0x7fffffffe7d8
(gdb) 
$21 = (const char **) 0x7fffffffe7d8
(gdb) 
$22 = (const char **) 0x7fffffffe7d8
(gdb) 
$23 = (const char **) 0x7fffffffe7d8
(gdb) 
$24 = (const char **) 0x7fffffffe7d8
(gdb) 
$25 = (const char **) 0x7fffffffe7d8
(gdb) 
$26 = (const char **) 0x7fffffffe7d8
(gdb) 
$27 = (const char **) 0x7fffffffe7d8
(gdb) 
$28 = (const char **) 0x7fffffffe7d8
(gdb) 
$29 = (const char **) 0x7fffffffe7d8
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      say_hello(argv[i]);
(gdb) p i
$30 = 1
(gdb) c s
Display all 200 possibilities? (y or n)
(gdb) c say_hello [K[K[K[K[K[K[K[K[K[K[K
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeaa8 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$31 = 0x7fffffffeaa8 "bart"
(gdb) backtrace
#0  say_hello (name=0x7fffffffeaa8 "bart") at hello.c:7
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe7d8) at hello.c:19
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe7d8) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p i
$32 = 1
(gdb) p argv
$33 = (const char **) 0x7fffffffe7d8
(gdb) p argv[Kc
$34 = 3
(gdb) down
#0  say_hello (name=0x7fffffffeaa8 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$35 = 0x7fffffffeaa8 "bart"
(gdb) up 
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe7d8) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p name
$36 = '\000' <repeats 32 times>
(gdb) down
#0  say_hello (name=0x7fffffffeaa8 "bart") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p ame[K[K[Kname
$37 = 0x7fffffffeaa8 "bart"
(gdb) 
$38 = 0x7fffffffeaa8 "bart"
(gdb) 
$39 = 0x7fffffffeaa8 "bart"
(gdb) c
Continuing.
hello bart

Breakpoint 2, say_hello (name=0x7fffffffeaad "lisa") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$40 = 0x7fffffffeaad "lisa"
(gdb) c
Continuing.
hello lisa

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$41 = 0x0
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe7d8) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p i
$42 = 3
(gdb) p argv
$43 = (const char **) 0x7fffffffe7d8
(gdb) p argv[Kc
$44 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 2584639] will be killed.

Quit anyway? (y or n) y
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ vi 
.gitignore  hello       hello.c     Makefile    README      
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ vi 
.gitignore  hello       hello.c     Makefile    README      
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ vi ge[K[Khello.c
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;28r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[28;1H"hello.c" 23L, 343C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<stdio.h>[m
[35m#include [m[31m<stdlib.h>[m

[32mstatic[m [32mvoid[m
say_hello([32mconst[m [32mchar[m *name)
{
  printf([31m"hello [m[35m%s\n[m[31m"[m, name);
}

[32mint[m
main([32mint[m argc, [32mconst[m [32mchar[m *argv[])
{
  [38;5;130mif[m (argc == [31m1[m) {
    fprintf([31mstderr[m, [31m"usage: [m[35m%s[m[31m NAME...[m[35m\n[m[31m"[m, argv[[31m0[m]);
    exit([31m1[m);
  }
  [38;5;130melse[m {
    [38;5;130mfor[m ([32mint[m i = [31m1[m; i <= argc; i++) {[19;7Hsay_hello(argv[i]);
    }
  }
  [38;5;130mreturn[m [31m0[m;
}
[94m~                                                                                [25;1H~                                                                                [26;1H~                                                                                [27;1H~                                                                                [m[28;64H1,1[11CAll[1;1H[?25h[?25l[28;54H~@k[1;1H[28;54H   [2;1H[28;64H2[2;1H[?25h[?25l[28;54H~@k[2;1H[28;54H   [3;1H[28;64H3,0-1[3;1H[?25h[?25l[28;54H~@k[3;1H[28;54H   [4;1H[28;64H4,1  [4;1H[?25h[?25l[28;54H~@k[4;1H[28;54H   [5;1H[28;64H5[5;1H[?25h[?25l[28;54H~@k[5;1H[28;54H   [6;1H[106m{

}[m[28;64H6[6;1H[?25h[?25l[28;54H~@k[6;1H[28;54H   [7;1H[6;1H{

}[28;64H7[7;1H[?25h[?25l[28;54H~@k[7;1H[28;54H   [8;1H[6;1H[106m{

}[m[28;64H8[8;1H[?25h[?25l[28;54H~@k[8;1H[28;54H   [9;1H[6;1H{

}[28;64H9,0-1[9;1H[?25h[?25l[28;54H~@k[9;1H[28;54H   [10;1H[28;64H10,1 [10;1H[?25h[?25l[28;54H~@k[10;1H[28;54H   [11;1H[28;65H1[11;1H[?25h[?25l[28;54H~@k[11;1H[28;54H   [12;1H[106m{[23;1H}[m[28;65H2[12;1H[?25h[?25l{[23;1H}[28;65H3[13;1H[?25h[?25l[28;54H~@k[13;1H[28;54H   [14;1H[28;65H4[14;1H[?25h[?25l[28;54H~@k[14;1H[28;54H   [15;1H[28;65H5[15;1H[?25h[?25l[28;54H~@k[15;1H[28;54H   [16;1H[28;65H6[16;1H[?25h[?25l[28;54H~@k[16;1H[28;54H   [17;1H[28;65H7[17;1H[?25h[?25l[28;54H~@k[17;1H[28;54H   [18;1H[28;65H8[18;1H[?25h[?25l[28;54H~@k[18;1H[28;54H   [18;2H[28;67H2[18;2H[?25h[?25l[28;54H~@k[18;2H[28;54H   [18;3H[28;67H3[18;3H[?25h[?25l[28;54H~@k[18;3H[28;54H   [18;4H[28;67H4[18;4H[?25h[?25l[28;54H~@k[18;4H[28;54H   [18;5H[28;67H5[18;5H[?25h[?25l[28;54H~@k[18;5H[28;54H   [18;6H[28;67H6[18;6H[?25h[?25l[28;54H~@k[18;6H[28;54H   [18;7H[28;67H7[18;7H[?25h[?25l[28;54H~@k[18;7H[28;54H   [18;8H[28;67H8[18;8H[?25h[?25l[28;54H~@k[18;8H[28;54H   [18;9H[106m([25C)[m[28;67H9[18;9H[?25h[?25l[28;54H~@k[18;9H[28;54H   [18;10H([25C)[28;67H10[18;10H[?25h[?25l[28;54H~@k[18;10H[28;54H   [18;11H[28;68H1[18;11H[?25h[?25l[28;54H~@k[18;11H[28;54H   [18;12H[28;68H2[18;12H[?25h[?25l[28;54H~@k[18;12H[28;54H   [18;13H[28;68H3[18;13H[?25h[?25l[28;54H~@k[18;13H[28;54H   [18;14H[28;68H4[18;14H[?25h[?25l[28;54H~@k[18;14H[28;54H   [18;15H[28;68H5[18;15H[?25h[?25l[28;54H~@k[18;15H[28;54H   [18;16H[28;68H6[18;16H[?25h[?25l[28;54H~@k[18;16H[28;54H   [18;17H[28;68H7[18;17H[?25h[?25l[28;54H~@k[18;17H[28;54H   [18;18H[28;68H8[18;18H[?25h[?25l[28;54H~@k[18;18H[28;54H   [18;19H[28;68H9[18;19H[?25h[?25l[28;54H~@k[18;19H[28;54H   [18;20H[28;67H20[18;20H[?25h[?25l[28;54H~@k[18;20H[28;54H   [18;21H[28;68H1[18;21H[?25h[?25l[28;54H~@k[18;21H[28;54H   [18;22H[28;68H2[18;22H[?25h[?25l[28;54H~@k[18;22H[28;54H   [18;23H[28;68H3[18;23H[?25h[?25l[28;54H~@k[18;23H[28;54H   [18;24H[28;68H4[18;24H[?25h[?25l[28;54H~@k[18;24H[28;54H   [18;25H[28;68H5[18;25H[?25h[?25l[28;54Hi[18;25H[28;54H [18;25H[28;1H[1m-- INSERT --[m[28;13H[K[28;64H18,25[9CAll[18;25H[?25h[?25l argc; i++) {[18;37H[K[28;68H4[18;24H[?25h[28;1H[K[18;23H[?25l[28;54H^[[18;23H[28;54H  [18;24H[28;64H18,23[9CAll[18;23H[?25h[?25l[28;54H~@k[18;23H[28;54H   [17;8H[106m{[21;3H}[m[28;65H7,8 [17;8H[?25h[?25l[28;54H~@k[17;8H[28;54H   [16;3H[13;18H[106m{[16;3H}[m[17;8H{[21;3H}[28;65H6,3[16;3H[?25h[?25l[28;54H~@k[16;3H[28;54H   [15;12H[13;18H{[16;3H}[28;65H5,12[15;12H[?25h[?25l[28;54H~@k[15;12H[28;54H   [14;23H[28;65H4,23[14;23H[?25h[?25l[28;54H~@k[14;23H[28;54H   [13;18H[106m{[16;3H}[m[28;65H3,18[13;18H[?25h[?25l[28;54H~@k[13;18H[28;54H   [12;1H[106m{[m[13;18H{[16;3H}[23;1H[106m}[m[28;65H2,1 [12;1H[?25h[?25l[28;54H~@k[12;1H[28;54H   [11;23H
{[23;1H}[28;65H1,23[11;23H[?25h[?25l[28;54H~@k[11;23H[28;54H   [11;1H[28;67H1 [11;1H[?25h[?25l[28;54H~@k[11;1H[28;54H   [10;4H[28;65H0,4[10;4H[?25h[?25l[28;54H<20>[10;4H[28;54H    [11;1H[28;65H1,1[11;1H[?25h[?25l[28;54H~@k[11;1H[28;54H   [11;1H[28;1H[1m-- INSERT --[m[28;64H[K[28;64H11,1[10CAll[11;1H[?25h[?25l[10;27r[27;1H
[1;28r[10;1H[32mint[m main([32mint[m argc, [32mconst[m [32mchar[m *argv[])[27;1H[94m~                                                                                [m[28;64H[K[28;64H10,5[10CAll[10;5H[?25h[?25l main([32mint[m argc, [32mconst[m [32mchar[m *argv[])[28;67H6[10;6H[?25h[?25lmain([32mint[m argc, [32mconst[m [32mchar[m *argv[])[10;39H[K[28;67H5[10;5H[?25h[?25lintmain([32mint[m argc, [32mconst[m [32mchar[m *argv[])[10;38H[K[28;67H4[10;4H[?25h[?25l[32mint[m main([32mint[m argc, [32mconst[m [32mchar[m *argv[])[28;67H5[10;5H[?25h[?25l[28;64H9,1 [9;1H[?25h[?25l[6;1H[106m{

}[m[28;64H8,2[8;2H[?25h[?25l[6;1H{

}[28;64H7,5[7;5H[?25h[?25l[6;1H[106m{

}[m[28;64H6,2[6;2H[?25h[?25l{

}[28;64H5,5[5;5H[?25h[?25l[28;66H1[5;1H[?25h[?25l[4;27r[27;1H
[1;28r[4;1H[32mstatic[m voidsay_hello([32mconst[m [32mchar[m *name)[27;1H[94m~                                                                                [m[28;64H[K[28;64H4,12[10CAll[4;12H[?25h[?25l[32mvoid[m say_hello([32mconst[m [32mchar[m *name)[28;67H3[4;13H[?25h[?25l[34m^Z[msay_hello([32mconst[m [32mchar[m *name)[28;67H4-15[4;15H[?25h[?25lsay_hello([32mconst[m [32mchar[m *name)[4;40H[K[28;67H3   [4;13H[?25h[?25l[5;27r[5;1H[L[1;28r[4;13H[K[5;1Hsay_hello([32mconst[m [32mchar[m *name)[28;64H[K[28;64H5,1[11CAll[5;1H[?25h[?25l
[106m{

}[m[28;64H6[6;1H[?25h[?25l{

}[28;64H7[7;1H[?25h[?25l[6;1H[106m{

}[m[28;64H8[8;1H[?25h[?25l[6;1H{

}[28;64H9[9;1H[?25h[?25l[28;64H10,1[10;1H[?25h[?25l
[106m{[22;1H}[m[28;65H1[11;1H[?25h[?25l{[22;1H}[28;65H0[10;1H[?25h[?25l[28;67H2[10;2H[?25h[?25l[28;67H3[10;3H[?25h[?25l[28;67H4[10;4H[?25h[?25l[28;67H5[10;5H[?25h[?25lintmain([32mint[m argc, [32mconst[m [32mchar[m *argv[])[10;38H[K[28;67H4[10;4H[?25h[?25l[11;27r[11;1H[L[1;28r[10;1H[32mint[m[10;4H[K[11;1Hmain([32mint[m argc, [32mconst[m [32mchar[m *argv[])[28;64H[K[28;64H11,1[10CAll[11;1H[?25h[28;1H[K[11;1H[?25l[28;54H^[[11;1H[28;54H  [11;1H[28;64H11,1[10CAll[11;1H[?25h[?25l[28;54H:[11;1H[28;54H[K[28;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?1000l[?2004l"hello.c" 23L, 342C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tfantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ./[K[Kmake
cc -g -Wall -std=c11    hello.c   -o hello
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ./hello Jo Mama
hello Jo
hello Mama
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ./hello bart lisa
hello bart
hello lisa
fantona1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ cd ../2-hello-upcase-args/
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c11    hello.c   -o hello
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello "[Kbart  liz[Ksa
Hello Bart
Hello Lisa
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello bart lisa[K[K[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[K"[K'jo  mama' 'joe mama2'
Hello Jo Mama
Hello Joe Mama2ƒŠ¶U
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'jo mama' 'joe mama2'[C[C[C[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[K[K[K[K[Kllo 'jac k and k[Kjill' 'climed up a hill to fetch a pail of water [K'
Hello Jack And JillU
Hello Climed Up A Hill To Fetch A Pail Of WaterCŠˆºU
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ cat hello.c
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */
void
upcase_words(const char in[], char out[])
{
  int inWord = 0;
  int n = strlen(in);
  for (int i = 0; i < n; i++) {
    if (!inWord && isalpha(in[i])) {
      out[i] = toupper(in[i]);
    }
    else {
      out[i] = in[i];
    }
    inWord = isalpha(in[i]);
  }
}

static void
say_hello(const char *name)
{
  printf("Hello %s\n", name);
}

int
main(int argc, const char *argv[])
{
  if (argc == 1) {
    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
    exit(1);
  }
  else {
    for (int i = 1; i < argc; i++) {
      const char *name = argv[i];
      char friendlyName[strlen(name)];
      upcase_words(name, friendlyName);
      say_hello(friendlyName);
    }
  }
  return 0;
}
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ cat hello.c./hello 'jack and jill' 'climed up a hill to fetch a pail of water'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Co mama' 'joe mama2'[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cack and jill' 'climed up a hill to fetch a pail of water'[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1Pcat hello.c
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Kgdb
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word".
(gdb) sa[Ktart hello[K[K[K[K[Kjoe mama
No symbol table loaded.  Use the "file" command.
(gdb) sar[K[Ktr=[K[Kart hello jo mama
No symbol table loaded.  Use the "file" command.
(gdb) q
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) 
(gdb) 
(gdb) 
(gdb) sa[Ktart jo mama
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/fantona1/projects/i220a/submit/lab2/exercises/2-hello-upcase-args/hello jo mama

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe7a8) at hello.c:35
35	  if (argc == 1) {
(gdb) b upcase_words 
Breakpoint 2 at 0x555555555195: file hello.c, line 13.
(gdb) b strlen
strlen         strlen.S       strlen@plt     
strlen-avx2.S  strlen.c       strlen_ifunc   
(gdb) b strlen
strlen         strlen.S       strlen@plt     
strlen-avx2.S  strlen.c       strlen_ifunc   
(gdb) b strlen
Breakpoint 3 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoint 3 also set at pc 0x7ffff7e5a070.
Breakpoint 4 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3 and 4 also set at pc 0x7ffff7e5a070.
Breakpoint 5 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4 and 5 also set at pc 0x7ffff7e5a070.
Breakpoint 6 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5 and 6 also set at pc 0x7ffff7e5a070.
Breakpoint 7 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6 and 7 also set at pc 0x7ffff7e5a070.
Breakpoint 8 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7 and 8 also set at pc 0x7ffff7e5a070.
Breakpoint 9 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8 and 9 also set at pc 0x7ffff7e5a070.
Breakpoint 10 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9 and 10 also set at pc 0x7ffff7e5a070.
Breakpoint 11 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10 and 11 also set at pc 0x7ffff7e5a070.
Breakpoint 12 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11 and 12 also set at pc 0x7ffff7e5a070.
Breakpoint 13 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 and 13 also set at pc 0x7ffff7e5a070.
Breakpoint 14 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13 and 14 also set at pc 0x7ffff7e5a070.
Breakpoint 15 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14 and 15 also set at pc 0x7ffff7e5a070.
Breakpoint 16 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 and 16 also set at pc 0x7ffff7e5a070.
Breakpoint 17 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16 and 17 also set at pc 0x7ffff7e5a070.
Breakpoint 18 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17 and 18 also set at pc 0x7ffff7e5a070.
Breakpoint 19 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18 and 19 also set at pc 0x7ffff7e5a070.
Breakpoint 20 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19 and 20 also set at pc 0x7ffff7e5a070.
Breakpoint 21 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20 and 21 also set at pc 0x7ffff7e5a070.
Breakpoint 22 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21 and 22 also set at pc 0x7ffff7e5a070.
Breakpoint 23 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22 and 23 also set at pc 0x7ffff7e5a070.
Breakpoint 24 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23 and 24 also set at pc 0x7ffff7e5a070.
Breakpoint 25 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24 and 25 also set at pc 0x7ffff7e5a070.
Breakpoint 26 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25 and 26 also set at pc 0x7ffff7e5a070.
Breakpoint 27 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26 and 27 also set at pc 0x7ffff7e5a070.
Breakpoint 28 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27 and 28 also set at pc 0x7ffff7e5a070.
Breakpoint 29 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28 and 29 also set at pc 0x7ffff7e5a070.
Breakpoint 30 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29 and 30 also set at pc 0x7ffff7e5a070.
Breakpoint 31 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30 and 31 also set at pc 0x7ffff7e5a070.
Breakpoint 32 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31 and 32 also set at pc 0x7ffff7e5a070.
Breakpoint 33 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32 and 33 also set at pc 0x7ffff7e5a070.
Breakpoint 34 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33 and 34 also set at pc 0x7ffff7e5a070.
Breakpoint 35 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) 
Note: breakpoints 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34 and 35 also set at pc 0x7ffff7e5a070.
Breakpoint 36 at gnu-indirect-function resolver at 0x7ffff7e5a070
(gdb) c
Continuing.

Breakpoint 2, upcase_words (in=0x7fffffffea86 "jo", out=0x7fffffffe650 "\001")
    at hello.c:13
13	  int inWord = 0;
(gdb) c
Continuing.
Hello Jo

Breakpoint 2, upcase_words (in=0x7fffffffea89 "mama", out=0x7fffffffe650 "Jo")
    at hello.c:13
13	  int inWord = 0;
(gdb) c
Continuing.
Hello Mama
[Inferior 1 (process 2589734) exited normally]
(gdb) c
The program is not being run.
(gdb) c
The program is not being run.
(gdb) c
The program is not being run.
(gdb) c
The program is not being run.
(gdb) c
The program is not being run.
(gdb) c
The program is not being run.
(gdb) c
The program is not being run.
(gdb) c
The program is not being run.
(gdb) cc
Undefined command: "cc".  Try "help".
(gdb) 
Undefined command: "cc".  Try "help".
(gdb) c
The program is not being run.
(gdb) 
The program is not being run.
(gdb) 
The program is not being run.
(gdb) q
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ vim hello.c
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;28r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[28;1H"hello.c" 48L, 962C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<ctype.h>[m
[35m#include [m[31m<stdio.h>[m
[35m#include [m[31m<stdlib.h>[m
[35m#include [m[31m<string.h>[m

[34m/** Upcase the initial letter of each word from in, copying the
 *  results into out.  The caller is responsible to ensure that out
 *  has enough space for the strlen(in) characters of in.
 */[m
[32mvoid[m
upcase_words([32mconst[m [32mchar[m in[], [32mchar[m out[])
{
  [32mint[m inWord = [31m0[m;
  [32mint[m n = strlen(in);
  [38;5;130mfor[m ([32mint[m i = [31m0[m; i < n; i++) {
    [38;5;130mif[m (!inWord && isalpha(in[i])) {[17;7Hout[i] = toupper(in[i]);
    }
    [38;5;130melse[m {[20;7Hout[i] = in[i];
    }
    inWord = isalpha(in[i]);
  }
}

[32mstatic[m [32mvoid[m
say_hello([32mconst[m [32mchar[m *name)[28;64H1,1[11CTop[1;1H[?25h[?25l[28;54H~@k[1;1H[28;54H   [2;1H[28;64H2[2;1H[?25h[?25l[28;54H~@k[2;1H[28;54H   [3;1H[28;64H3[3;1H[?25h[?25l[28;54H~@k[3;1H[28;54H   [4;1H[28;64H4[4;1H[?25h[?25l[28;54H~@k[4;1H[28;54H   [5;1H[28;64H5,0-1[5;1H[?25h[?25l[28;54H~@k[5;1H[28;54H   [6;1H[28;64H6,1  [6;1H[?25h[?25l[28;54H~@k[6;1H[28;54H   [7;1H[28;64H7[7;1H[?25h[?25l[28;54H~@k[7;1H[28;54H   [8;1H[28;64H8[8;1H[?25h[?25l[28;54H~@k[8;1H[28;54H   [9;1H[28;64H9[9;1H[?25h[?25l[28;54H~@k[9;1H[28;54H   [10;1H[28;64H10,1[10;1H[?25h[?25l[28;54H~@k[10;1H[28;54H   [10;2H[28;67H2[10;2H[?25h[?25l[28;54H~@k[10;2H[28;54H   [10;3H[28;67H3[10;3H[?25h[?25l[28;54H~@k[10;3H[28;54H   [10;4H[28;67H4[10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [10;4H[?25h[?25l[28;54H~@k[10;4H[28;54H   [11;4H[28;65H1[11;4H[?25h[?25l[28;54H~@k[11;4H[28;54H   [12;1H[106m{[24;1H}[m[28;65H2,1[12;1H[?25h[?25l[28;54H~@k[12;1H[28;54H   [13;4H[12;1H{[24;1H}[28;65H3,4[13;4H[?25h[?25l[28;54H~@k[13;4H[28;54H   [14;4H[28;65H4[14;4H[?25h[?25l[28;54H~@k[14;4H[28;54H   [14;5H[28;67H5[14;5H[?25h[?25l[28;54H~@k[14;5H[28;54H   [14;6H[28;67H6[14;6H[?25h[?25l[28;54H~@k[14;6H[28;54H   [14;7H[28;67H7[14;7H[?25h[?25l[28;54H~@k[14;7H[28;54H   [14;8H[28;67H8[14;8H[?25h[?25l[28;54H~@k[14;8H[28;54H   [14;9H[28;67H9[14;9H[?25h[?25l[28;54H~@k[14;9H[28;54H   [14;10H[28;67H10[14;10H[?25h[?25l[28;54H~@k[14;10H[28;54H   [14;11H[28;68H1[14;11H[?25h[?25l[28;54H~@k[14;11H[28;54H   [14;12H[28;68H2[14;12H[?25h[?25l[28;54H~@k[14;12H[28;54H   [14;13H[28;68H3[14;13H[?25h[?25l[28;54H~@k[14;13H[28;54H   [14;14H[28;68H4[14;14H[?25h[?25l[28;54H~@k[14;14H[28;54H   [14;15H[28;68H5[14;15H[?25h[?25l[28;54H~@k[14;15H[28;54H   [14;16H[28;68H6[14;16H[?25h[?25l[28;54H~@k[14;16H[28;54H   [14;17H[106m([min[106m)[m[28;68H7[14;17H[?25h[?25l[28;54H~@k[14;17H[28;54H   [14;18H(in)[28;68H8[14;18H[?25h[?25l[28;54H~@k[14;18H[28;54H   [14;19H[28;68H9[14;19H[?25h[?25l[28;54H~@k[14;19H[28;54H   [14;20H[106m([min[106m)[m[28;67H20[14;20H[?25h[?25l[28;54H~@k[14;20H[28;54H   [14;21H(in)[28;68H1[14;21H[?25h[?25l[28;54H+[14;21H[28;54H [15;3H[28;65H5,3 [15;3H[?25h[?25l[28;54H1[15;3H[?25h[?25l[28;55Hi[15;3H[28;54H  [15;3H[28;1H[1m-- INSERT --[m[28;13H[K[28;64H15,3[10CTop[15;3H[?25h[?25l[28;65H4[14;3H[?25h[?25l[28;67H4[14;4H[?25h[?25l[28;67H5[14;5H[?25h[?25l[28;67H6[14;6H[?25h[?25l[28;67H7[14;7H[?25h[?25l[28;67H8[14;8H[?25h[?25l[28;67H9[14;9H[?25h[?25l[28;67H10[14;10H[?25h[?25l[28;68H1[14;11H[?25h[?25l1strlen(in);[28;68H2[14;12H[?25h[?25l[31m1[m strlen(in);[28;68H3[14;13H[?25h[?25l+strlen(in);[28;68H4[14;14H[?25h[?25l strlen(in);[28;68H5[14;15H[?25h[?25l[28;65H5[15;15H[?25h[?25l[28;65H6[16;15H[?25h[?25l[28;65H7[17;15H[?25h[?25l[16;36H[106m{[18;5H}[m[28;65H8,6 [18;6H[?25h[?25l[16;36H{[18;5H}[19;10H[106m{[21;5H}[m[28;65H9,11[19;11H[?25h[?25l{[21;5H}[28;64H20,15[20;15H[?25h[?25l[19;10H[106m{[21;5H}[m[28;65H1,6 [21;6H[?25h[?25l[19;10H{[21;5H}[28;65H2,15[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;1H{[28;64H[K[28;64H23,4[11C4%[14;31H[106m{[22;3H}[?25h[?25l[1;27r[m[27;1H
[1;28r[27;3Hprintf([31m"Hello [m[35m%s\n[m[31m"[m, name);[28;64H[K[28;64H24,2[11C9%[10;1H[106m{[m[13;31H{[21;3H}
[106m}[?25h[?25l[1;27r[m[27;1H
[1;28r[27;1H}[28;64H[K[28;64H25,1[10C14%[9;1H{[21;1H}
[?25h[?25l[1;27r[27;1H
[1;28r[28;64H[K[28;64H26,12[9C19%[22;12H[?25h[?25l[1;27r[27;1H
[1;28r[27;1H[32mint[m[28;64H[K[28;64H27,15[9C23%[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;1Hmain([32mint[m argc, [32mconst[m [32mchar[m *argv[])[28;64H[K[28;64H28,2[10C28%[22;1H[106m{

}[22;2H[?25h[?25l[1;27r[m[27;1H
[1;28r[27;1H{[28;64H[K[28;64H29,15[9C33%[21;1H{

}[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;3H[38;5;130mif[m (argc == [31m1[m) {[28;64H[K[28;64H30,2[10C38%[20;1H[106m{

}[?25h[?25l[1;27r[m[27;1H
[1;28r[27;5Hfprintf([31mstderr[m, [31m"usage: [m[35m%s[m[31m NAME...[m[35m\n[m[31m"[m, argv[[31m0[m]);[28;64H[K[28;64H31,1[10C42%[19;1H{

}
[?25h[?25l[1;27r[27;1H
[1;28r[27;5Hexit([31m1[m);[28;64H[K[28;64H32,4[10C47%[22;4H[?25h[?25l[1;27r[27;1H
[1;28r[27;3H}[28;64H[K[28;64H33,15[9C52%[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;3H[38;5;130melse[m {[28;64H[K[28;64H34,2[10C57%[22;2H[?25h[?25l[1;27r[27;1H
[1;28r[27;5H[38;5;130mfor[m ([32mint[m i = [31m1[m; i < argc; i++) {[28;64H[K[28;64H35,15[9C61%[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;7H[32mconst[m [32mchar[m *name = argv[i];[28;64H[K[28;64H36,15[9C66%[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;7H[32mchar[m friendlyName[strlen(name)];[28;64H[K[28;64H37,13[9C71%[22;13H[?25h[?25l[1;27r[27;1H
[1;28r[27;7Hupcase_words(name, friendlyName);[28;64H[K[28;64H38,4[10C76%[19;18H[106m{[22;3H}[?25h[?25l[1;27r[m[27;1H
[1;28r[27;7Hsay_hello(friendlyName);[28;64H[K[28;64H39,9[10C80%[18;18H{[21;3H}[22;9H[?25h[?25l[1;27r[27;1H
[1;28r[27;5H}[28;64H[K[28;64H40,15[9C85%[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;3H}[28;64H[K[28;64H41,15[9C90%[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;3H[38;5;130mreturn[m [31m0[m;[28;64H[K[28;64H42,15[9C95%[22;15H[?25h[?25l[1;27r[27;1H
[1;28r[27;1H}[28;64H[K[28;64H43,15[9CBot[22;15H[?25h[?25l[28;65H4[23;15H[?25h[?25l[19;36H[106m{[24;5H}[m[28;65H5,6 [24;6H[?25h[?25l[18;8H[106m{[m[19;36H{[24;5H}
  [106m}[m[28;65H6,4[25;4H[?25h[?25l[18;8H{[25;3H}[28;65H7,12[26;12H[?25h[?25l[13;1H[106m{[27;1H}[m[28;65H8,2 [27;2H[?25h[?25l[13;1H{[27;1H}[28;65H7,12[26;12H[?25h[?25l[18;8H[106m{[25;3H}[m[28;65H6,4 [25;4H[?25h[?25l[18;8H{[19;36H[106m{[24;5H}[m
  }[28;65H5,6[24;6H[?25h[?25l[19;36H{[24;5H}[28;65H4,15[23;15H[?25h[?25l[28;65H3[22;15H[?25h[?25l[28;65H2[21;15H[?25h[?25l[28;65H3[22;15H[?25h[?25l[28;65H4[23;15H[?25h[?25l[28;65H3[22;15H[?25h[?25l[28;65H4[23;15H[?25h[?25l[28;65H3[22;15H[?25h[?25l[28;65H2[21;15H[?25h[?25l[28;68H6[21;16H[?25h[?25l[28;68H8[21;18H[?25h[?25l[28;68H9[21;19H[?25h[?25l[28;67H20[21;20H[?25h[?25l[28;68H1[21;21H[?25h[?25l[28;68H2[21;22H[?25h[?25l[28;68H3[21;23H[?25h[?25le[106m[[12C][m[28;68H4[21;24H[?25h[?25l[28;68H5[21;25H[?25h[?25l1strlen(name[106m)[m];[21;24H[[12C)[28;68H6[21;26H[?25h[?25l[31m1[m strlen(name)];[28;68H7[21;27H[?25h[?25l+strlen(name)];[28;68H8[21;28H[?25h[?25l strlen(name)];[28;68H9[21;29H[?25h[28;1H[K[21;28H[?25l[28;54H^[[21;28H[28;54H  [21;29H[28;64H42,28[9CBot[21;28H[?25h[?25l[28;54H:[21;28H[28;54H[K[28;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?1000l[?2004l"hello.c" 48L, 970C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0tfantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ hell[K[K[K[Kmake
cc -g -Wall -std=c11    hello.c   -o hello
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello Lisa [A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[Klisa  bart
Hello Lisa
Hello Bart
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ 
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello lisa bart[K[K[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[Kjose ph r biden
Hello Joseph
Hello R
Hello Biden
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello joseph r biden is  [Ka [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[Kbori s johnson
Hello Boris
Hello Johnson
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello boris johnson\[K[K[K[K[K[K[K[K[K[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K
[K[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[K[K[K[K "Don ald John Trump" "B[KJoes[K[Ks[Kesp[Keph R Biden" "T[KKyriakos Mitsotakis" "Boris johnson'[K"[1P[1@b[1P[1@m[1P[1@k[1P[1@b[1P[1@j[1P[1@t[1P[1@j[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Conal[1P[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cdona[1@l[A[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C

Hello Donald John Trump
Hello Joeseph R Biden
Hello Kyriakos Mitsotakis
Hello Boris Johnson
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ # program wo rs!!!
fantona1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ exit

Script done on 2020-09-10 10:49:16-04:00 [COMMAND_EXIT_CODE="0"]
